
"""n = int(input())
print('The next number for the number ' + str(n) + ' is ' + str(n + 1) + '.')
print('The previous number for the number ' + str(n) + ' is ' + str(n - 1) + '.')"""


"""Задача «Следующее и предыдущее»
Условие
Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы важны!)."""

# int "12" -> 12
# str 12 -> "12"
# "hello " + "harry"""

f=(1,2,3,4,5,6,"11")
i=(1,2,"123",None)
print(f.count("11"))

if d:
    print(1)

if b=="456":
    print("Da!")
elif b=='123'
else:
    print("Net")

print(f[-8])
print(a[2])