"""n=int(input())
print( "The next number for the number" +  str(n) +  "is" +  str(n+1))
print()"""

n = int(input())
print('The next number for the number ' + str(n) + ' is ' + str(n + 1) + '.')
print('The previous number for the number ' + str(n) + ' is ' + str(n - 1) + '.')


"""Занятие 1. Ввод и вывод данных Задача «следующее и предыдущее»

Условие Напишите программу, которая считывает  текст и выводит целое число, аналогичный приведенному в примере 
(пробелы важны!).
Во всех задачах считывайте входные данные через input() и выводите ответ через print().
Примеры входных данных:
1534
Примеры выходных данных:

The next number for the number 1534 is 1535.
The previous number for the number 1534 is 1533."""