
n = int(input())
print('The next number for the number ' + str(n) + ' is ' + str(n + 1) + '.')
print('The previous number for the number ' + str(n) + ' is ' + str(n - 1) + '.')


"""Задача «Следующее и предыдущее»
Условие
Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы важны!)."""

# int "12" -> 12
# str 12 -> "12"
# "hello " + "harry"